export interface contentBlog {
  title?: string | null;
  content?: string;
}

export interface contentList {
  title: string;
  content: Array<string>;
}

export interface blog {
  id: number;
  head: string;
  subtitle?: string;
  contentLists?: Array<contentList>;
  contentBlogs?: Array<contentBlog>;
  contents?: Array<string>;
  cradit: string;
  img: string;
}

export const blogs: Array<blog> = [
  {
    id: 1,
    head: `แมวเบื่ออาหาร ปัญหาที่ทำให้ทาสหลายคนทุกข์ใจ`,
    subtitle:
      'บางครั้งที่มนุษย์อย่างเรานั้นจะรู้สึกเบื่ออาหาร ไม่รู้จะกินอะไร กินอะไรก็ไม่ลง แมวที่เราเลี้ยงก็สามารถมีอาการดังกล่าวได้เช่นเดียวกัน สังเกตเห็นได้อย่างชัดเจนเลยว่าแมวจะไม่รับประทานอาหารในปริมาณที่เท่าเดิม มีอาการเมินหรือปฏิเสธอาหาร หากปล่อยทิ้งไว้และไม่แก้ไขอาจส่งผลต่อสุขภาพของแมวระยะยาว',
    contentBlogs: [
      {
        title: 'สาเหตุ ทำไมแมวจึงไม่อยากอาหาร',
        content:
          'เวลาแมวเบื่ออาหารสาเหตุก็มักจะเกิดขึ้นคล้ายกับเวลาที่คนเบื่ออาหาร หากไม่ได้มีปัญหาเรื่องสุขภาพแมวก็มักจะเกิดจากการที่เราวางชามเอาไว้ในตำแหน่งที่ไม่เหมาะสม ทำให้แมวรู้สึกไม่สบายใจหรือรู้สึกสกปรกพอดันวางใกล้กับกระบะทราย อาหารที่ให้เป็นอาหารที่ไม่เหมาะสม ภาชนะที่ใช้มีความไม่เหมาะสมกับแมว การให้อาหารแบบผิดๆ อย่างเช่นการให้แบบบุฟเฟต์เดินกินได้ตลอดทั้งวันเป็นต้น',
      },
    ],
    contentLists: [
      {
        title: 'วิธีการแก้ไขเมื่อเจอปัญหาแมวของเราไม่ยอมกินอาหาร',
        content: [
          'ตำแหน่งการวางชาม เป็นสิ่งสำคัญอย่างมากเพราะพวกเขามีพื้นที่ในการกินแบบเฉพาะตัวตามสัญชาตญาณเดิมสมัยเป็นแมวป่า แมวจะกินอาหารในสถานที่ที่รู้สึกปลอดภัยและสบายใจมากที่สุด สามารถมองเห็นพื้นที่ได้โดยรอบ เราจึงควรวางอาหารแมวไว้ในจุดที่ทำให้แมวรู้สึกสบายใจ',
          'การให้อาหาร ปกติแล้วเรามักจะให้อาหารแมวในถ้วยหรือชามเป็นหลักเนื่องจากค่อนข้างสะดวกและลดการกินเลอะเทอะได้ แต่บางครั้งแมวที่มีหนวดยาวหรือขนยาวก็ไม่สะดวกในการก้มลงไปกินอาหารในถ้วยเช่นเดียวกัน',
          'ประเภทอาหาร หลายคนเลี้ยงแมวด้วยการให้อาหารเม็ดเนื่องจากมีสารอาหารครบถ้วนสำหรับแมว แต่อย่างไรก็ตามด้วยความที่พวกมันเป็นสัตว์กินเนื้อ มันจึงสำคัญที่เราควรให้เนื้อเป็นอาหารหลักสำหรับแมวอย่างน้อยวันละ 1 มื้อ จะช่วยให้พวกเขารู้สึกอยากอาหารมากขึ้นกว่าเดิม',
          'จัดเวลา เป็นสิ่งที่ยุ่งยากและต้องปรึกษาสัตวแพทย์ว่าเราควรจัดตารางการให้อาหารแมวอย่างไร แต่โดยทั่วไปแล้วเราควรให้อาหารแมววันละ 2 มื้อ ห่างกันมื้อละ 8 ถึง 12 ชั่วโมง',
        ],
      },
    ],
    cradit: `https://guscats.com/%e0%b9%81%e0%b8%a1%e0%b8%a7%e0%b9%80%e0%b8%9a%e0%b8%b7%e0%b9%88%e0%b8%ad%e0%b8%ad%e0%b8%b2%e0%b8%ab%e0%b8%b2%e0%b8%a3-%e0%b8%9b%e0%b8%b1%e0%b8%8d%e0%b8%ab%e0%b8%b2%e0%b8%97%e0%b8%b5%e0%b9%88%e0%b8%97/`,
    img: '',
  },
  {
    id: 2,
    head: 'เรื่อง แมว แมว',
    subtitle: '',
    contents: [
      'แมวเป็นที่นิยมเลี้ยงในทุกยุคทุกสมัยและทุกที่บนโลก ทุกปีในประเทศญี่ปุ่นจะมีวันแห่งแมว ซึ่งเป็นวันที่ชาวญี่ปุ่นทำการเฉลิมฉลองกับเจ้าเหมียวอย่างหรรษา ที่มาของวันดังกล่าวมาจากเสียงร้องของเจ้าเหมียวที่ไปพ้องเสียงกับเลข 2 ในภาษาญี่ปุ่น ดังนั้นทุกวันที่ 22 เดือน 2 จึงกลายเป็นวันของแมวไปโดยปริยาย',
      'นอกจากนี้กองทุนเพื่อสวัสดิการสัตว์ระหว่างประเทศ หรือ IFAW ก็ยังกำหนดให้วันที่ 8 สิงหาคมของทุกปีเป็นวันแมวโลก โดยมีวัตถุประสงค์เพื่อให้ประชาชนและผู้เลี้ยงแมวทั่วโลกคำนึงถึงสวัสดิภาพของแมว',
      'คริสโตเฟอร์ ฮิตเชนส์ นักเขียนลูกครึ่งอังกฤษ-อเมริกัน กล่าวว่า “เจ้าของสุนัขจะรู้ว่าถ้าคุณให้อาหาร น้ำ ที่พักพิง และความรักแก่สุนัข สุนัขจะคิดว่าคุณคือพระเจ้า แต่สำหรับเจ้าของแมวก็จะตระหนักว่าถ้าคุณให้อาหาร น้ำ ที่พักพิง และความรักแก่แมว แมวจะสรุปว่าพวกมันคือพระเจ้า” นี่อาจเป็นที่มาของคำว่า “ทาสแมว”',
      'เหตุที่ดูเหมือนแมวจะมีอำนาจเหนือคนเลี้ยง อาจมาจากนิสัยรักสันโดษของมันซึ่งสืบต่อจากบรรพบุรุษที่มาจากป่า ย้อนกลับไปสัก 6.2 ล้านปีก่อน แมวบ้าน หรือในชื่อวิทยาศาสตร์ Felis catus ถือกำเนิดขึ้นมาบนโลกพร้อมกับขนาดที่เล็กจิ๋ว เมื่อโตเต็มวัยจะหนักเพียง 4.1 ถึง 5.4 กิโลกรัมเท่านั้น ความยาวเฉลี่ย 76.2 เซนติเมตร อาศัยอยู่ทุกทวีปในโลก ยกเว้นแอนตาร์กติกา',
      'มีการพบมัมมี่แมวอายุ 4,000 ปีในเมืองซัคคาราซึ่งเคยเป็นเมืองหลวงของอาณาจักรอียิปต์โบราณ อยู่ทางตอนใต้ของกรุงไคโร นั่นหมายความว่าเจ้าเหมียวมีอิทธิพลกับเหล่ามนุษย์มานานแล้ว',
      'แมวบ้านในยุคแรกๆ คาดว่าวิวัฒนาการมาจากแมวป่าแอฟริกันและแมวทะเลทรายในเอเชีย แมวบ้านกว่า 100 สายพันธุ์มีรูปร่างและขนาดที่ใกล้เคียงกัน เช่น น้ำหนักตัว ความยาวลำตัว รวมถึงลักษณะกระดูกซึ่งมีทั้งหมดราว 244 ชิ้น และ 30 เปอร์เซ็นต์เป็นกระดูกสันหลัง นี่ทำให้เจ้าแมวหันหลังได้ถึง 180 องศา นอกจากนี้มันยังมีกรงเล็บที่หดได้ในแต่ละอุ้งเท้าและไม่ขยายออกเวลาเดิน',
      'เจ้า Felis catus นี้ปรับตัวเข้าหามนุษย์ได้อย่างไม่น่าเชื่อ ในขณะที่แมวอีกสกุลหนึ่ง คือ Pardofelis marmorata หรือแมวลายหินอ่อน ยังคงดำรงชีวิตเช่นเดิม Pardofelis เป็นหนึ่งในสกุลแมวที่เก่าแก่ที่สุด มีอายุ 9.4 ล้านปี และยังดำรงพันธุ์มาจนปัจจุบัน',
      'Felis Catus เริ่มเข้าหามนุษย์ตั้งแต่ยุคหินใหม่ หรือราว 8,000-4,000 ปีก่อนคริสตกาล ในช่วงนั้นมีการเปลี่ยนแปลงครั้งยิ่งใหญ่ทางวัฒนธรรมของมนุษยชาติ คือเริ่มมีการปลูกข้าวเป็นครั้งแรก มีการเลี้ยงสัตว์ ทำเครื่องปั้นดินเผา และมนุษย์เลิกเป็นผู้เสาะหาอาหาร แต่กลายมาเป็นผู้ผลิตอาหารแทน',
      'Eva-Maria Geigl นักพันธุศาสตร์เชิงวิวัฒนาการ บอกว่า คลังเก็บเมล็ดพันธุ์ของชุมนุมเกษตรกรรมยุคแรกๆ ดึงดูดสัตว์ฟันแทะให้เข้ามาสร้างความเสียหาย และเจ้าสัตว์ฟันแทะที่ว่าก็ดึงดูดสัตว์ป่าอีกชนิดหนึ่งให้ตามมาด้วย นั่นคือ “แมว”',
    ],
    cradit:
      'https://www.sarakadee.com/2020/09/22/%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87-%E0%B9%81%E0%B8%A1%E0%B8%A7-%E0%B9%81%E0%B8%A1%E0%B8%A7/',
    img: '',
  },
  {
    id: 3,
    head: 'เรื่องควรรู้ของทาสแมวมือใหม่',
    subtitle:
      'แมว เป็นสัตว์ที่รักอิสระ ที่มีความน่ารัก ขี้เล่น และเป็นสัตว์ที่รักความสะอาด ดังนั้นแมวจึงเป็นสัตว์เลี้ยงยอดนิยมที่คนเลือกนำมาเลี้ยง และจำเป็นต้องได้รับการดูแลอย่างเหมาะสมสำหรับผู้เลี้ยงแมวมือใหม่ ก่อนที่จะทำการเลือกแมวมาเลี้ยงนั้น สิ่งแรกที่คุณต้องตัดสินใจไม่ใช่ว่าจะเลือกตัวไหนมาเลี้ยงดี แต่ต้องติดสินใจว่าคุณเหมาะสมที่จะเลี้ยงแมวหรือไม่ โดยคำนึงถึงปัจจัยหลาย ๆ อย่าง เช่น การให้เวลาเลี้ยงดูเจ้าแมวเหมียว การให้อาหาร การทำความสะอาดกระบะทราย รวมทั้งค่าใช้จ่ายต่าง ๆ เป็นต้น',

    contentBlogs: [
      {
        title: 'วิธีการเลือกลูกแมวเหมียวให้เหมาะกับตัวคุณ',
      },
      {
        title: '1. สายพันธุ์',
        content:
          'ควรทำการศึกษาลักษณะของแมวในแต่ละสายพันธุ์ เพื่อให้ได้แมวที่มีลักษณะและนิสัยที่ตรงตามความต้องการและเหมาะสมกับตัวคุณ รวมถึงการดูแลรักษาสุขภาพของแมวในแต่ละสายพันธุ์ เช่น แมวขนยาว จำเป็นต้องได้รับการดูแล และทำความสะอาดขนมากกว่าแมวขนสั้น',
      },
      {
        title: '2. เพศ',
        content:
          'แมวตัวผู้จะมีนิสัยชอบหนีออกจากบ้าน จึงเหมาะกับเจ้าของที่ไม่ค่อยมีเวลาดูแลและเอาใจมากนัก ส่วนแมวเพศเมียนิสัยค่อนข้างติดบ้านไม่เหมือนแมวตัวผู้ ดังนั้นจึงเหมาะสำหรับเจ้าของที่มีเวลาว่างส่วนใหญ่อยู่บ้าน',
      },
      {
        title: '3. สุขภาพของแมว',
        content:
          'ควรเลือกแมวที่มีสุขภาพแข็งแรง ขนสะอาดปราศจากเห็บหมัด ผิวหนังไม่มีแผลหรือการอักเสบ ดวงตาสดใสเป็นประกายไม่มีขี้ตาเกรอะกรัง จมูกไม่มีน้ำมูกหรือคราบน้ำมูก ไม่มีอาการไอหรือหายใจหอบ ปาก และเหงือกสีชมพูไม่มีกลิ่น ฟันขาวสะอาด หูสะอาด ไม่มีขี้หูเป็นคราบดำ หรือไรหู บริเวณรอบทวารหนักต้องสะอาดไม่มีคราบอุจจาระเกรอะกรัง หากมีคราบอุจจาระเลอะติดกันอยู่แสดงว่าแมวอาจมีอาการถ่ายเหลว ซึ่งแสดงว่าแมวอาจป่วยจากการติดเชื้อในทางเดินอาหารได้',
      },
      {
        title: '4. อายุ',
        content:
          'สำหรับผู้เลี้ยงแมวมือใหม่ที่มีความพร้อม และมีเวลาดูแลเอาใจใส่ ควรเลี้ยงแมวตั้งแต่ยังเป็นลูกแมว เนื่องจากฝึกสอนได้ง่าย แต่สำหรับผู้เลี้ยงที่ไม่ค่อยมีเวลามากนัก ควรเลือกแมวที่โตแล้วมาเลี้ยงดีกว่า เนื่องจากไม่จำเป็นต้องดูแลเอาใจใส่มากนัก สำหรับอายุลูกแมวที่เหมาะสมในการนำมาเลี้ยงควรอายุตั้งแต่ 8-10 สัปดาห์ขึ้นไป ซึ่งเป็นช่วงที่แมวหย่านมแล้ว และสามารถกินอาหารจากจานได้เอง',
      },
    ],
    cradit:
      'https://www.yippeehappy.com/th/blog/detail/774/%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%84%E0%B8%A7%E0%B8%A3%E0%B8%A3%E0%B8%B9%E0%B9%89%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B8%97%E0%B8%B2%E0%B8%AA%E0%B9%81%E0%B8%A1%E0%B8%A7-%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88',
    img: '',
  },
  {
    id: 4,
    head: 'ประโยชน์ของการทำหมันแมว',
    subtitle:
      'การทำหมันแมวมีข้อดีหลายประการ ไม่ว่าจะเป็นการช่วยลดโอกาสการเกิดโรคบางโรค หรือช่วยแก้ปัญหาด้านพฤติกรรมที่ไม่พึงประสงค์ต่าง ๆ ดังต่อไปนี้',
    contentBlogs: [
      {
        title: 'ลดจำนวนประชากรแมวที่ไม่ต้องการ',
        content:
          'ปฏิเสธไม่ได้ว่าปัญหาแมวจรจัดยังเป็นปัญหาที่พบได้มากในปัจจุบัน การทำหมันแมวจะช่วยลดการเกิดของลูกแมวที่เจ้าของไม่ได้ตั้งใจหรือไม่ต้องการ และยังช่วยลดการเพิ่มของแมวจรจัดในลำดับต่อมา',
      },
      {
        title: 'ลดโอกาสการเกิดโรค',
        content:
          'การทำหมันแมวช่วยลดโอกาสการเกิดโรคได้ โดยเฉพาะโรคที่เกี่ยวข้องกับระบบสืบพันธุ์ทั้งในแมวเพศผู้และเพศเมีย เช่น ช่วยลดโอกาสเกิดมะเร็งเต้านม หรือช่วยลดความผิดปกติที่อาจเกิดขึ้นที่บริเวณรังไข่ มดลูก หรืออัณฑะ เป็นต้น',
      },
      {
        title: 'ลดการแสดงอาการติดสัด',
        content:
          'ในแมวเพศเมียวัยเจริญพันธุ์ที่ยังไม่ได้ทำหมัน โดยปกติแล้วตามธรรมชาติมักจะแสดงอาการติดสัด เช่น การส่งเสียงร้องโหยหวน บิดตัวไปมา อันเป็นสัญญาณบ่งบอกว่าแมวพร้อมที่จะผสมพันธุ์ ซึ่งการทำหมันแมวเพศเมียจะช่วยลดอาการเหล่านี้ ที่สร้างความกวนใจให้กับบางคนได้',
      },
      {
        title: 'ลดพฤติกรรมก้าวร้าว',
        content:
          'โดยทั่วไปแมวเพศผู้ที่อยู่ในวัยเจริญพันธุ์ มักจะมีนิสัยก้าวร้าว ดุร้าย หรือทะเลาะกันเพื่อแย่งแมวเพศเมีย ซึ่งการทำหมันแมวเพศผู้ นอกจากจะช่วยลดพฤติกรรมก้าวร้าวเหล่านี้ได้แล้ว ยังช่วยลดโอกาสที่แมวเพศผู้จะได้รับบาดเจ็บจากการต่อสู้ และลดความเสี่ยงจากการติดโรคต่าง ๆ ทางบาดแผล',
      },
      {
        title: 'ลดพฤติกรรมการสร้างอาณาเขต',
        content:
          'เนื่องจากพฤติกรรมสร้างอาณาเขตด้วยการปัสสาวะของแมวเพศผู้ (urine marking) เป็นพฤติกรรมที่เกี่ยวข้องกับฮอร์โมนเพศผู้ ดังนั้นการทำหมันแมวเพศผู้ ซึ่งเป็นการตัดลูกอัณฑะที่เป็นแหล่งผลิตฮอร์โมนเพศผู้ออกไป จึงมีส่วนช่วยให้พฤติกรรมเหล่านี้ในแมวเพศผู้ลดลงได้',
      },
    ],
    cradit:
      'https://www.purina.co.th/articles/cats/behaviour/understanding-cats/spay-benefit',
    img: '',
  },
];
