export interface cat {
  id: number;
  bleed: {
    eng: string;
    th: string;
  };
  price: string;
  locate: {
    eng: string;
    th: string;
  };
  general_nature: {
    info: string;
    img: string;
  };
  general_character: {
    info: string;
    img: string;
  };
  husbandry: string;
  derivation: string;
  img: Array<string>;
}

const cats: Array<cat> = [
  {
    id: 1,
    price: '1,000-8,000 บาท',
    bleed: {
      eng: 'Persian',
      th: 'เปอร์เซีย ',
    },
    img: [
      '/cats/persian/01.png',
      '/cats/persian/02.png',
      '/cats/persian/03.png',
    ],
    locate: {
      eng: 'Persia,Iran',
      th: 'เปอร์เซีย,อิหร่าน',
    },
    general_nature: {
      info: 'มีขนาดกลางถึงขนาดใหญ่ มีกระดูกที่ใหญ่และแข็งแรง หน้าผากโหนก แก้มเต็ม ดวงตากลมโต จมูกหัก มองจากด้านข้างจะเห็นจุดหักระหว่างจมูกกับหน้าผากชัดเจน เมื่อมองจากด้านหน้าจะเห็นเป็นขีดอยู่ระหว่างดวงตา',
      img: '/cats/persian/04.png',
    },
    general_character: {
      info: 'มีอุปนิสัยอ่อนโยน เข้ากับคนอื่นได้ง่าย มีความร่าเริงซุกซน ช่างประจบประแจง และเป็นแมวที่มีไหวพริบมาก',
      img: '/cats/persian/05.png',
    },
    husbandry:
      'จะต้องดูแลเรื่องขนเป็นพิเศษ แปรงขน เช็ดหน้า และคราบน้ำตาทุกวัน ',
    derivation:
      'แมวเปอร์เซีย เป็นราชินีแมวจากแดนตะวันออกกลาง มีถิ่นกำเนิดอยู่ในแถบเปอร์เซีย หรือประเทศตุรกีกับอิหร่าน เป็นแมวต่างประเทศสายพันธุ์แรกที่ถูกนำเข้ามาในประเทศไทย พันธุ์นี้เป็นที่นิยมในหมู่คนรักแมว หน้าตาน่าเอ็นดู ขนปุกปุย นิสัยน่ารักมาก ๆ ',
  },
  {
    id: 2,
    price: '3,000-40,000 บาท',
    img: [
      '/cats/USAshorthair/01.png',
      '/cats/USAshorthair/02.png',
      '/cats/USAshorthair/03.png',
    ],
    bleed: {
      eng: 'American Shorthair',
      th: 'อเมริกัน ชอร์ตแฮร์ ',
    },
    locate: {
      eng: 'United States',
      th: 'สหรัฐอเมริกา',
    },
    general_nature: {
      info: 'เป็นแมวที่ช่างสงสัย นิสัยร่าเริง ชอบเล่น มีเสน่ห์ฝึกค่อนข้างยาก เจ้าของควรจะคลุกคลีและอยู่กับแมวให้มาก ๆ มีสัญชาตญาณการเป็นนักล่า ชอบไล่จับแมลง และมองดูนก  ',
      img: '/cats/USAshorthair/04.png',
    },
    general_character: {
      info: 'มีขนาดกลางไปจนถึงขนาดใหญ่ โครงสร้างลำตัวโต มีกล้ามเนื้อแข็งแรง มองเห็นชัดเจน อกใหญ่ ขาใหญ่ ใบหูมีขอบเป็นทรงกลมมน ส่วนหัวมีลักษณะรูปไข่ ดวงตากลมโตเป็นสีเขียวมรกต มีลักษณะสีขน และรูปร่างมากกว่า 80 แบบ',
      img: '/cats/USAshorthair/05.png',
    },
    husbandry: 'ควรจะแปรงขนบ่อย ๆ และควรควบคุมน้ำหนัก ไม่ให้เกินมาตรฐาน',
    derivation:
      'แมวอเมริกัน ชอร์ตแฮร์  เป็นแมวสายพันธุ์อเมริกาที่สืบเชื้อสายมาจากประเทศในแถบยุโรป แพร่พันธุ์มายังอเมริกา เป็นแมวพื้นเมืองขนสั้นของอเมริกา ',
  },
  {
    id: 3,
    price: '15,000-80,000 บาท',
    img: ['/cats/exotic/07.png', '/cats/exotic/02.png', '/cats/exotic/03.png'],
    bleed: {
      eng: 'Exotic',
      th: 'เอ็กโซติก',
    },
    locate: {
      eng: 'สหรัฐอเมริกา',
      th: 'United States',
    },
    general_nature: {
      info: 'มีลักษณะคล้ายคลึงกับแมวเปอร์เซีย แต่ลักษณะจุดเด่นคือ เป็นแมวหัวกลม ตาโต กะโหลกใหญ่ ใบหูกลมเล็ก จมูกหัก หน้าแบน ขนสั้นแต่หนาแน่นนุ่มคล้ายกำมะหยี่',
      img: '/cats/exotic/04.png',
    },
    general_character: {
      info: 'มีนิสัยน่ารัก ขี้เล่น ซื่อสัตย์ต่อเจ้าของ และอดทนได้ดี อยู่กับคนได้ อยู่ตัวเดียวได้ นอกจากนี้ยังรักความเงียบสงบ ไม่ค่อยส่งเสียงร้อง ป็นแมวที่มีความสุภาพ อ่อนโยน ไม่ค่อยหงุดหงิด และมีความอดทนสูง',
      img: '/cats/exotic/05.png',
    },
    husbandry:
      'ดูแลง่ายกว่าเปอร์เซียโดยไม่ต้องทำความสะอาดขนบ่อยๆ แต่ก็ต้องหมั่นทำความสะอาดเช็ดคราบน้ำตา ที่เหลือก็เลี้ยงง่าย ดูแลไม่ยาก แค่จัดสภาพแวดล้อมให้เหมาะสม ก็ไม่ต้องทุ่มเทให้เวลามาก',
    derivation:
      'เป็นแมวหน้าบูด จมูกหัก ขนนุ่ม สืบเชื้อสายมาจากแมว 2 สายพันธุ์ ระหว่างแมวเปอร์เซียกับแมวอเมริกัน ชอร์ตแฮร์',
  },
  {
    id: 4,
    price: '15,000-150,000 บาท',
    img: ['/cats/Bengal/01.jpg', '/cats/Bengal/02.jpg', '/cats/Bengal/03.jpg'],
    bleed: {
      eng: 'Bengal',
      th: 'เบงกอล',
    },
    locate: {
      eng: '',
      th: '',
    },
    general_nature: {
      info: 'มีขนาดปานกลางถึงค่อนข้างใหญ่ หัวมีความยาวมากกว่าความกว้าง มีมัดกล้ามเนื้อชัดเจนคล้ายแมวป่า เมื่อมองจากด้านข้างจะเห็นช่วงสะโพกมีความสูงกว่าหัวไหล่ ปลายหางชี้ลง ใบหูกลมสั้น ตารูปไข่ มีช่วงปากกับจมูกกลมกว่าแมวบ้าน มีจุดเด่นอยู่ที่ลายขนคล้ายแมวป่า หรือที่เรียกกันว่า ลายหินอ่อน',
      img: '/cats/Bengal/04.jpg',
    },
    general_character: {
      info: 'มีนิสัยน่ารัก ไม่ดุร้าย เป็นมิตรกับทุกคน เป็นแมวที่ซุกซน เพราะชอบวิ่งไล่สิ่งของต่าง ๆ ชอบปีนป่ายขึ้นที่สูงอยู่เป็นประจำ ชอบเล่นน้ำเอามาก ๆ ด้วย',
      img: '/cats/Bengal/05.jpg',
    },
    husbandry:
      'ดูแลง่าย มีการผลัดขนปกติ และควรใส่ใจในเรื่องอาหารเป็นพิเศษ ห้ามให้เนื้อไก่หรือหมูโดยเด็ดขาด',
    derivation:
      'เป็นแมวที่มีลวดลายสวยงาม คล้ายลูกเสือดาวตัวน้อย ๆ เกิดจากการผสมพันธุ์ระหว่างแมวดาวกับแมวบ้านสายพันธุ์อียิปต์เชียนมัวร์ ',
  },
  {
    id: 5,
    price: '5,000-70,000 บาท',
    img: [
      '/cats/scottish_fold/01.png',
      '/cats/scottish_fold/02.png',
      '/cats/scottish_fold/03.png',
    ],
    bleed: {
      eng: 'Scottish Fold',
      th: 'สก็อตติช โฟลด์',
    },
    locate: {
      eng: 'Scotland',
      th: 'สก็อตแลนด์',
    },
    general_nature: {
      info: 'มีขนาดปานกลาง แบ่งออกเป็น 2 แบบคือ แบบขนสั้นกับแบบขนยาว ทั้ง 2 แบบจะมีลักษณะตัวกลม หัวกลม มีช่วงคอสั้น ดวงตากลมใหญ่ และมีหูตั้งตรง ไปจนถึงหูพับ จมูกสันโค้งกว้างรับกับดวงตา บางตัวมีปากโค้งได้รูปรับกับคางพอดี',
      img: '/cats/scottish_fold/04.png',
    },
    general_character: {
      info: 'มีนิสัยดี ขี้เล่น อ่อนโยน สอนง่าย ชอบเล่นกับเจ้าของ เข้ากับเด็กและสุนัขได้ ไม่ชอบอยู่ตามลำพัง ต้องการความรักความเอาใจใส่พอสมควร เป็นแมวที่ค่อนข้างฉลาด เป็นมิตร ติดคน สนใจสิ่งแวดล้อมรอบตัว แถมยังเป็นแมวช่างพูดด้วย',
      img: '/cats/scottish_fold/05.png',
    },
    husbandry:
      'ต้องการการดูแลปานกลาง ต้องการพื้นที่วิ่งเล่นพอสมควร หมั่นดูแลทำความสะอาดขน ช่องหู และพาไปตรวจสุขภาพเป็นประจำ ทั้งนี้ ระวังอย่าจับหรือเล่นหางเพราะอาจจะทำให้ข้ออักเสบได้ ควรแปรงขนสัปดาห์ละ 1-2 ครั้ง ไม่ต้องอาบน้ำบ่อย ',
    derivation:
      'เป็นแมวหูพับ เนื่องจากเป็นยีนส์ด้อย แต่ก็ทำให้แมวสายพันธุ์นี้หัวกลมเหมือนนกฮูก เป็นแมวที่มาจากประเทศสกอตแลนด์ ผสมพันธุ์ค่อนข้างยาก แต่ได้รับความนิยมค่อนข้างมาก ',
  },
  {
    id: 6,
    price: '25,000-70,000 บาท',
    img: ['/cats/sphynx/01.png', '/cats/sphynx/02.png', '/cats/sphynx/03.png'],
    bleed: {
      eng: 'Sphynx',
      th: 'สฟิงซ์',
    },
    locate: {
      eng: 'Canada',
      th: 'แคนาดา',
    },
    general_nature: {
      info: 'มีขนาดปานกลาง มาพร้อมหูทรงสามเหลี่ยม หน้าทรงสี่เหลี่ยมจัตุรัส มีโหนกแก้มและจุดหนวด รูปร่างผอมเพรียว หางยาว ที่สำคัญมีภาพจำคือผิวหนังเหี่ยวย่นแต่อุ่นนิ่ม และขนสั้นมากหรือแทบจะไม่มีขนไม่มีขนหรือมีขนบาง ๆ ที่จมูกและหลังหู มีสีและลายบนผิวหนังได้หลายแบบ',
      img: '/cats/sphynx/05.png',
    },
    general_character: {
      info: 'มีนิสัยน่ารัก ขี้อ้อน ฉลาด อ่อนโยน และร่าเริง เข้ากับเจ้าของ เด็ก คนแปลกหน้า และสัตว์เลี้ยงอื่นได้ดี เป็นแมวที่กระตือรือร้น ชอบนอนบนเตียงกับเจ้าของ',
      img: '/cats/sphynx/06.png',
    },
    husbandry:
      'ดูแลอาบน้ำทำความสะอาดแต่ไม่ควรบ่อยเกินไป ประมาณ 2-3 เดือนครั้งต้องดูแลผิวหนังไม่ให้ไหม้แดด หรือโดนอากาศหนาวจัด เหมาะกับการเลี้ยงในบ้าน ฝึกฝนไม่ยาก',
    derivation:
      'เป็นแมวที่พัฒนามาจากแมวไร้ขน ต้นกำเนิดมาจากประเทศแคนาดา จุดเด่น คือ เหมาะกับคนที่เป็นภูมิแพ้ หรือแพ้คนแมว เพราะขนสั้นและบางจนแทบจะไม่มีหลุดออกมากวนใจเลย จึงช่วยลดโปรตีน ต้นเหตุที่ก่อให้เกิดอาการแพ้น้อยลงได้พอสมควร',
  },
  {
    id: 7,
    price: '10,000-60,000 บาท',
    img: [
      '/cats/main_coon/01.png',
      '/cats/main_coon/03.png',
      '/cats/main_coon/03.png',
    ],
    bleed: {
      eng: 'Main coon',
      th: 'เมนคูน',
    },
    locate: {
      eng: 'United States',
      th: 'สหรัฐอเมริกา',
    },
    general_nature: {
      info: 'มีรูปร่างขนาดใหญ่ รูปร่างสง่างาม สมส่วน ให้ความรู้สึกมั่นคงแข็งแรง ใบหน้าเหมือนกับแมวป่า มีแผงคอคล้ายสิงโต ปลายหูยังมีเส้นขนงอกออกมา',
      img: '/cats/main_coon/04.png',
    },
    general_character: {
      info: 'มีนิสัยขี้อ้อน ขี้เล่น ร่าเริง เป็นมิตร เข้าสังคมเก่ง ฉลาด สุภาพกับคนรอบข้างและสัตว์อื่น',
      img: '/cats/main_coon/05.png',
    },
    husbandry:
      'การเลี้ยงดูควรเสริมด้วยเนื้อสัตว์ที่มีโปรตีนสูงเนื่องจากต้องใช้ในการเจริญเติบโตมาก  ส่วนขนค่อนข้างหวีง่าย เป็นแมวกึ่งขนยาว ไม่พันกันเหมือนแมวเปอร์เซีย ควรอาบน้ำเดือนละ 2 ครั้ง หลังจากอาบควรเป่าขนให้แห้งสนิทเพื่อป้องกันเชื้อราบนผิวหนัง',
    derivation:
      'เป็นแมวมีร่างกายใหญ่โตกว่าแมวปกติแต่นิสัยใจดี จนได้รับสมญานามว่า Gentle Giant ชื่อ Main Coon มาจากถิ่นกำเนิดรัฐเมน (Maine) ของสหรัฐอเมริกา ส่วน Coon มาจากคำบอกเล่าของชาวพื้นเมืองว่าแมวเผลอไปกิ๊กกับแรคคูน จนกลายเป็นชื่อเรียกทั่วไปของแมวพันธุ์นี้ว่า Main Coon',
  },
  {
    id: 8,
    price: '3,000-7,000 บาท',
    img: [
      '/cats/Siamese/01.jpg',
      '/cats/Siamese/02.jpg',
      '/cats/Siamese/03.jpg',
    ],
    bleed: {
      eng: 'Siamese',
      th: 'วิเชียรมาศ',
    },
    locate: {
      eng: 'United States',
      th: 'ไทย',
    },
    general_nature: {
      info: 'แมววิเชียรมาศเป็นแมวที่มีแต้มสีน้ำตาลเข้ม 9 จุด คือ ปลายเท้าทั้งสี่ ปลายหูทั้งสอง ปลายหาง บนปลายจมูก และอีกหนึ่งจุดที่อวัยวะเพศ ลักษณะเด่นคือเมื่อแมววิเชียรมาศไปผสมกับพันธุ์ใดก็ตามจะให้กำเนิดลูกที่มีจำนวนจุดตามเดิม เพียงแต่รูปร่างและนิสัยเปลี่ยนไป',
      img: '/cats/Siamese/04.jpg',
    },
    general_character: {
      info: 'มีนิสัยของแมวพันธุ์นี้ก็คล้ายแมวไทยทั่วไป มีความฉลาด คล่องแคล่ว ปราดเปรียว เรียบร้อย เป็นตัวของตัวเอง ขี้อ้อน ขี้ประจบ',
      img: '/cats/Siamese/05.jpg',
    },
    husbandry:
      'วิเชียรมาศจัดเป็นแมวขนสั้น สามารถเลียขนดูแลทำความสะอาดตัวเองได้อาบน้ำเดือนละครั้ง นอกนั้นก็ทำความสะอาดใบหู ตัดเล็บ และดูแลฟัน อ่านต่อได้ที่ ',
    derivation:
      'เป็นแมวพันธุ์ไทยที่ชาวต่างชาติรู้จักกันดีในชื่อ Siamese Cat หรือแมวสยาม ซึ่งปัจจุบันได้ถูกนำไปพัฒนาสายพันธุ์จนเกิดเป็นแมวไทยหลากสายพันธุ์ สมัยก่อนเชื่อกันว่าผู้ใดได้เลี้ยงดูแมวพันธุ์นี้จะได้เป็นขุนนาง มีลาภยศ เนื่องจากสมัยก่อนนิยมเลี้ยงแมวพันธุ์นี้ในวังเป็นส่วนใหญ่',
  },
  {
    id: 9,
    price: '15,000-80,000 บาท',
    img: ['/cats/bs/01.jpeg', '/cats/bs/02.jpeg', '/cats/bs/03.jpeg'],
    bleed: {
      eng: 'British shorthair',
      th: 'บริติช ชอร์ตแฮร์',
    },
    locate: {
      eng: 'United Kingdom',
      th: 'สหราชอาณาจักร',
    },
    general_nature: {
      info: 'เป็นแมวขนาดใหญ่ถึงกลาง รูปร่างกลมหนา พลังเยอะ อกกว้าง คอหนา กรามและขาแข็งแรง จุดเด่น คือ หน้ากลม แก้มยุ้ย หูกลม หูกลม ตาโต หางหนา ดูคล้ายตุ๊กตา แถมขนและลายสวยงาม สั้น ตรง หนานุ่ม มีทั้งแบบสีล้วน สองสี สามสี และลายทาง มีทั้งสีขาว สีเทา สีดำ สีน้ำตาล ทว่าที่พบเห็นบ่อยที่สุดก็คือสีสวาดนั่นเอง',
      img: '/cats/bs/04.jpeg',
    },
    general_character: {
      info: 'มีนิสัยฉลาด ซื่อสัตย์ ไม่ดุร้าย ชอบความเงียบสงบ แต่ก็ไม่มีปัญหากับเด็กและสัตว์อื่น อยู่ตัวเดียวก็ได้ อยู่กับเจ้าของก็ดี ไม่ค่อยชอบให้อุ้ม',
      img: '/cats/bs/05.jpeg',
    },
    husbandry:
      'นิสัยนิ่งสงบ ปรับตัวเข้ากับสภาพแวดล้อมได้ง่าย ชอบที่จะให้เท้าอยู่ติดพื้นมากกว่า และจะรู้สึกไม่สบายตัวเวลาที่ถูกอุ้มไปไหนมาไหน แมวบริติช ชอร์ตแฮร์ควรดูแลเรื่องอาหารเป็นพิเศษ เนื่องจากเป็นแมวที่โครงสร้างใหญ่แต่ตัวเตี้ย ต้องควบคุมน้ำหนักไม่ให้มากเกินไป จนเกิดปัญหากระดูกและข้อ',
    derivation:
      'แมวสายพันธุ์บริติช ชอร์ตแฮร์นั้นสืบเชื้อสายมาจากแมวโรมันที่ถูกนำมายังเกาะอังกฤษโดยชาวโรมัน แมวสายพันธุ์นี้อาจจะผสมข้ามสายพันธุ์กับแมวในท้องถิ่นบนเกาะและยังคงเป็นสัตว์เลี้ยงภายในบ้าน',
  },
  {
    id: 10,
    price: '2500-4500 บาท',
    img: [''],
    bleed: {
      eng: 'Korat',
      th: 'โคราช',
    },
    locate: {
      eng: 'Thailand',
      th: 'ไทย',
    },
    general_nature: {
      info: 'แมวโคราชเป็นแมวพันธุ์ขนาดกลาง ลำตัวแข็งแรงค่อนข้างกลม เท้าเป็นรูปไข่ ด้านหน้าตัวผู้หน้าผากจะมีรอยหยัก กรามใหญ่และแข็งแรง ซึ่งทำให้มองเห็นเป็นรูปหัวใจอย่างเด่นชัด หูใหญ่ตั้งสูงเด่น ขนมีสีสวาดออกเทาเงิน เส้นขนสั้นถึงยาวปานกลาง เป็นเงามันเหลื่อม ถ้าออกแดดจะออกประกายเข้มสีเทาเงินคล้ายดอกเลา ดวงตาใหญ่เมื่อเป็นลูกแมวตาเป็นสีฟ้า โตขึ้นเปลี่ยนเป็นสีเหลืองสดหรือเขียว',
      img: '',
    },
    general_character: {
      info: 'มีนิสัยค่อนข้างฉลาด จำเจ้าของแม่น ขี้ประจบ มีนิสัยคล้ายสิงโตโดยสร้างอาณาจักรของตัวเองโดยการฉี่รอบที่อยู่อาศัย มีนิสัยขี้ระแวงไม่ไว้วางใจหรืออาจจะขู่',
      img: '',
    },
    husbandry:
      'แมวโคราชควรใส่ใจเรื่องการถ่ายพยาธิและการฉีดวัคซีนเป็นพิเศศ วัคซีนป้องกันหัดแมว ลูคีเมีย และพิษสุนัขบ้า',
    derivation:
      'แมวโคราช มีชื่อเรียกมากมาย แมวสีสวาด แมวมาเลศ แมวดอกเลา แมวสีเทา ต้นกำเนิดพบที่อำเภอพิมาย จังหวัดนครราชสีมา เป็นแมวที่ให้โชคลาภที่ดี 17 ตัวของประเทศไทย ผูกพันกับคนไทยมานาน เป็นแมวที่ใช้ในพิธีแห่นางแมวขอฝน',
  },
];

export { cats };
