export interface knowlage {
  id: number;
  head: string;
  content: string;
  img: string;
}

export const knowlages: Array<knowlage> = [
  {
    id: 1,
    head: 'แมวมีเซนส์อันยอดเยี่ยมเกี่ยวกับเรื่องแผ่นดินไหว',
    content:
      'เนื่องจากใต้อุ้งเท้าของแมวค่อนข้างเซนซิทีฟ ดังนั้นแมวทุกตังจึงสามารถรู้ล่วงหน้าได้ว่า จะมีแผ่นดินไหวเกิดขึ้นหรือไม่อย่างไร ส่วนคุณเองก็สามารถรับรู้ได้เช่นกัน โดยสังเกตได้จากพฤติกรรมแปลก ๆ หรือแตกต่างออกไปจากเดิมนั่นเอง และด้วยเหตุนี้เองจึงทำให้มีคนบางกลุ่มใช้อุ้งเท้าแมวในการหาค้นหาเหตุแผ่นดินไหวจากแรงสะเทือนด้วย',
    img: '/cats/Siamese/06.jpg',
  },
  {
    id: 2,
    head: 'แมวไม่เข้าใจการโดนลงโทษ',
    content:
      'การโดนลงโทษไม่มีผลใด ๆ กับแมวเลย เพราะแมวไม่มีทางเข้าใจสิ่งที่คุณทำ ดังนั้นถ้าหากคุณต้องการฝึกแมวให้ทำตามคำสั่ง ก็ควรสอนด้วยความอดทน คำชม และตอบแทนด้วยรางวัล ก็จะเห็นผลลัพธ์ที่ดีกว่า',
    img: '/cats/Siamese/09.jpg',
  },
  {
    id: 3,
    head: 'แมวก็มีฝันเหมือนกัน',
    content:
      'ความฝัน มักจะเกิดขึ้นเมื่อแมวอยู่ในภาวะผ่อนคลาย และสบายตัวมากพอที่จะทำให้พวกมันหลับลึก โดยในช่วงดังกล่าวแมวจะมีการสร้างรูปแบบของคลื่นสมองแบบเดียวกันกับเวลาที่คนกำลังฝันนั่นเอง',
    img: '/cats/exotic/06.png',
  },
  {
    id: 4,
    head: 'แมวเป็นนายที่แท้จริงของบ้าน',
    content:
      'เพราะแมวสามารถเปล่งโทนเสียงเพื่อใช้ควบคุมพฤติกรรมของคนได้ อย่างเช่น ในเวลาที่แมวต้องการจะกินอาหาร มันก็จะใช้โทนเสียงที่ฟังคล้าย ๆ กับเสียงร้องไห้ออกมา เพื่อเป็นการกระตุ้นคุณให้เอาอาหารให้มันเร็วขึ้น เป็นต้น',
    img: '/cats/Siamese/05.jpg',
  },
  {
    id: 5,
    head: 'กลืนและย่อยอาหารได้โดยไม่ต้องเคี้ยว',
    content:
      'อีกหนึ่งเรื่องที่น่าสนใจไม่แพ้กันก็คือ กระเพาะของแมวสามารถย่อยและดูดกลืนอาหารได้โดยไม่ต้องเคี้ยว ซึ่งถือเป็นข่าวดีมากทีเดียวสำหรับเจ้า ลิล บับ (Lil Bub) หนึ่งในแมวเซเลบชื่อดังจากโลกออนไลน์ เพราะมันเป็นแมวที่ไม่มีฟันตั้งแต่กำเนิด จะได้ไม่มีอะไรให้กังวล',
    img: '/cats/Siamese/06.jpg',
  },
  {
    id: 6,
    head: 'ไม่มีใครรู้ว่า เสียงคราง เกิดจากอะไร',
    content:
      'กระทั่งถึงตอนนี้ นักวิทยาศาสตร์เองก็ยังไม่รู้ว่า เสียงครางของแมวเกิดขึ้นได้อย่างไร และเกิดจากระบบส่วนใดกันแน่ ในขณะที่คนส่วนใหญ่เชื่อว่า เกิดจากบริเวณลำคอ แต่ก็มีบางกลุ่มที่คิดว่า น่าจะเกิดจากระบบไหลเวียนเลือดมากกว่า',
    img: '/cats/Siamese/06.jpg',
  },
  {
    id: 7,
    head: 'แมวครางเพื่อแสดงความพอใจ',
    content:
      'ถึงแม้แมวจะครางเมื่อรู้สึกพึงพอใจเป็นส่วนใหญ่ แต่ก็มีบางครั้งที่แมวครางเมื่อเกิดอาการเจ็บป่วยได้เช่นเดียวกัน และถ้าหากคุณคุ้นเคยกับแมวมากพอ ก็จะสามารถแยกความแตกต่างของเสียงครางของแมวได้ด้วยตัวเอง',
    img: '/cats/Siamese/08.jpg',
  },
  {
    id: 8,
    head: 'แมวส่งเสียงครางได้นานกว่าที่คิด',
    content:
      'หลายคนอาจจะคิดว่า แมวส่งเสียงครางเป็นบางเวลาและมักจะเกิดขึ้นในช่วงเวลาสั้น ๆ ขณะที่กำลังมีความสุขหรือพึงพอใจ แต่แท้จริงแล้วแมวสามารถครางได้นานกว่านั้น แต่บางตัวอาจครางนานเป็นสัปดาห์เลยก็มี',
    img: '/cats/Bengal/06.jpg',
  },
];
